app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hi"], ["email", "gii"], ["created_at", "2016-03-24 14:19:05.495401"], ["updated_at", "2016-03-24 14:19:05.495401"]]
---
  def create
    @user = User.create(user_params)